#### FilterOperatorAndTextString Members

---

|  |
| --- |
| FilterOperatorAndTextString Class   Methods   Properties   See Also |

The  FilterOperatorAndTextString  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FilterOperatorAndTextString |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FilterOperatorStr | A text string denoting the filter operator. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OperatorType | The filter operator. |

# See Also

FilterOperatorAndTextString Class

Autodesk.Revit.DB Namespace